cases/STM-1/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.5;

boundaryField
{
    inlet
    {
        type            cyclic;
    }

    bottom.snow
    {
        type            kqRWallFunction;
        value           uniform 0.0;
    }

    top
    {
        type            zeroGradient;
    }

    sides
    {
        type            empty;
    }

    outlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
