cases/STM-1/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        refTol          0.001;
    }

    pFinal
    {
        solver          PCG;
        preconditioner  DIC;
        tolerance       1e-6;
        refTol          0;
    }


    "(U|k|epsilon|omega)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        refTol          0.001;
    }

    driftDensity
    {
        solver          GAMG;
        smoother        GaussSeidel;
        tolerance       1e-12;
        refTol          0;
    }

    "(U|k|epsilon|omega)Final"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        tolerance       1e-8;
        refTol          0;
    }
}

PIMPLE
{
    correctPhi                  no;
    momentumPredictor           no;

    nOuterCorrectors            0;
    nCorrectors                 0;
    nNonOrthogonalCorrectors    0;
    pRefCell                    0;
    pRefValue                   0;
}

relaxationFactors
{
    equations
    {
        p                    1;
        U                    1;
        "(k|epsilon|omega)"  1;
    }
}


// ************************************************************************* //
